brew "1password-cli"
brew "bat"
brew "codex"
brew "curl"
brew "direnv"
brew "editorconfig"
brew "fastfetch"
brew "gh"
brew "gibo"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "itermai"
brew "lazygit"
brew "m-cli"
brew "mas"
brew "neofetch"
brew "neovim"
brew "openssl"
brew "pinentry-mac"  # For enter passphrase
brew "pygments"
brew "sl"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "xz"
brew "zsh"

cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "caffeine"
cask "discord"
cask "divvy"
cask "docker"
cask "github"
cask "google-japanese-ime"
cask "iterm2"
cask "jordanbaird-ice"
cask "keybase"
cask "obsidian"
cask "yubico-yubikey-manager"
cask "visual-studio-code"
cask "font-meslo-lg-nerd-font"

tap "homebrew/autoupdate"
