# Tap repositories and install packages
tap "caskroom/cask"
cask "appcleaner"
cask "caffeine"
cask "cheatsheet"
cask "discord"
cask "divvy"
cask "docker"
# cask "dropbox"  # Install manually
cask "google-japanese-ime"
cask "iterm2"
cask "java"
cask "keybase"
cask "slack"

tap "homebrew/core"
brew "curl"
brew "editorconfig"
brew "gibo"
brew "git"
brew "gnupg"
brew "m-cli"
brew "mas"
brew "openssl"
brew "pinentry-mac"  # For enter passphrase
brew "python3"
brew "sl"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "xz"
brew "zsh"
brew "zsh-completions"

# App Store applications
mas "1Password", id: 1333542190
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
mas "Witch", id: 412485838
